Description: Download latest Spotify dmg, builds an universal package with both the arm64 and X86_64 versions and installs it.
Identifier: com.github.macbofh.install.spotify-universal
ParentRecipe: com.github.macbofh.pkg.spotify-universal
MinimumVersion: '2.3'

Input:
  NAME: Spotify

Process:
  - Processor: Installer