<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Identifier</key>
  <string>com.github.macbofh.download.PreForm</string>

  <key>MinimumVersion</key>
  <string>1.0</string>

  <key>Description</key>
  <string>Downloads the latest PreForm release via Sparkle appcast.</string>

  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>PreForm</string>
    <key>appcast_url</key>
    <string>https://updates.formlabs.com/v2/preform/release/mac/sparkle.xml</string>
  </dict>

  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>SparkleUpdateInfoProvider</string>
      <key>Arguments</key>
      <dict>
        <key>appcast_url</key>
        <string>%appcast_url%</string>
      </dict>
    </dict>

    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%url%</string>
        <!-- Optional controlled filename: uncomment if you prefer -->
        <!-- <key>filename</key><string>%NAME%-%version%.dmg</string> -->
      </dict>
    </dict>
  </array>
</dict>
</plist>