Description: Create pkg from the Jamf Connect 2
Identifier: com.github.macbofh.pkg.jamfconnect2
Input:
  NAME: Jamf Connect
MinimumVersion: '2.3'
ParentRecipe: com.github.macbofh.download.jamfconnect2
Process:
- Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg'
  Processor: AppDmgVersioner
- Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
    source_pkg: '%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/JamfConnect.pkg'
  Processor: PkgCopier        
- Processor: EndOfCheckPhase
