<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Rumpus 8 disk image.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.Rumpus8</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Rumpus 8</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.maxum.com/Rumpus81Updates/UpdateInfo.txt</string>
                <key>re_pattern</key>
                <string>(8.[0-9].[0-9])</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%match%.dmg</string>
                <key>url</key>
                <string>http://www.maxumdev.com/DownloadPackages/Rumpus-%match%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>