Description: Downloads the ARM and Intel versions of Miro
Identifier: com.github.macbofh.download.miro-universal
MinimumVersion: '2.3'

Input:
  NAME: Dropbox
  URL_ARM64: https://desktop.miro.com/platforms/darwin-arm64/Miro.dmg
  URL_X86_64: https://desktop.miro.com/platforms/darwin/Miro.dmg

Process:
  - Processor: URLDownloader
    Arguments:
      filename: '%NAME%-arm64.dmg'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: '%URL_ARM64%'

  - Processor: URLDownloader
    Arguments:
      filename: '%NAME%-x86_64.dmg'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: '%URL_X86_64%'

  - Processor: EndOfCheckPhase