Description: Create pkg from both ARM and Intel versions of Miro
Identifier: com.github.macbofh.pkg.miro-universal
Input:
  NAME: Miro
MinimumVersion: '2.3'
ParentRecipe: com.github.macbofh.download.miro-universal
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.macbofh.download.miro-universal:
      git_hash: 82ce1e3a23d27f104114dd077e2d44e5399f1ad7
      path: /Users/Shared/Storage/autopkgr/RecipeRepos/com.github.macbofh.AutoPKG-recipes/Miro-Universal/Miro.Universal.download.recipe.yaml
      sha256_hash: cb5207b296f85ef4ad328416664c4b143e5948b95515f51fc2f23fda71b9d19b
Process:
- Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/silicon/%NAME%-arm64.dmg'
  Processor: AppDmgVersioner
- Arguments:
    app_path: '%RECIPE_CACHE_DIR%/silicon/%NAME%-arm64.dmg/%NAME%.app'
    pkg_path: '%RECIPE_CACHE_DIR%/silicon/%NAME%-arm64-%version%.pkg'
  Processor: AppPkgCreator
