<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of TextExpander 7 and makes a package.</string>
	<key>Identifier</key>
	<string>com.github.macbofh.pkg.TextExpander7</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TextExpander7</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.macbofh.download.TextExpander7</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%pathname%/TextExpander.app</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
