Description: Downloads the ARM and Intel versions of Postman
Identifier: com.github.macbofh.download.postman-universal
MinimumVersion: '2.3'

Input:
  NAME: Postman
  URL_ARM64: https://dl.pstmn.io/download/latest/osx_arm64
  URL_X86_64: https://dl.pstmn.io/download/latest/osx_64

Process:
  - Processor: URLDownloader
    Arguments:
      filename: '%NAME%-arm64.dmg'
      download_dir: '%RECIPE_CACHE_DIR%/silicon'
      url: '%URL_ARM64%'

  - Processor: URLDownloader
    Arguments:
      filename: '%NAME%-x86_64.dmg'
      download_dir: '%RECIPE_CACHE_DIR%/intel'
      url: '%URL_X86_64%'

  - Processor: EndOfCheckPhase
